#include <stdio.h>
int main() {
    printf("a=%6.3f%%\n", 0.617);
    printf("b=%4d%%\n", 25);
    printf("c =%.3f%%\n", 19.000);
    printf("d  =%-2d%%\n", 9);
    printf("e=%.3f%%\n", 124.555);
    printf("f=%.3f%%\n", 0.001);
    return 0;
}
//1. สำหรับการรับ–ส่งข้อมูล
//2. เริ่มต้นโปรแกรม
//3. %.3f คือให้แสดงจุดทศนิยม 3หลัก 6ช่องชิดขวา
//4. %4d คือแสดงเลขจำนวนเต็ม 4ช่องชิดขวา
//5. %.3f จุดทศนิยม 3ตำแหน่ง 
//6. %-2d แสดงเลขจำนวนเต็ม 2ช่องชิดซ้าย
//7. %.3f จุดทศนิยม 3ตำแหน่ง
//8. %.3f จุดทศนิยม 3ตำแหน่ง
//9. จบการทำงาน